       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC X(8).
       01 WS-RESULT PIC 9.
         01 I PIC 99.
         01 LEN PIC 99.
         01 WS-SUM PIC 9(9).
         01 WS-NUM PIC 9(9).

       PROCEDURE DIVISION.
       ARMSTRONG-NUMBERS.
         MOVE 0 TO WS-SUM
         MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-NUMBER)) TO LEN
         PERFORM VARYING I FROM 1 BY 1 UNTIL I > LEN
            MOVE WS-NUMBER(I:1) TO WS-NUM
            COMPUTE WS-NUM = WS-NUM ** LEN
            ADD WS-NUM TO WS-SUM
         END-PERFORM
         MOVE WS-NUMBER TO WS-NUM
         IF WS-NUM = WS-SUM
            MOVE 1 TO WS-RESULT
         ELSE
            MOVE 0 TO WS-RESULT
         END-IF